rails_demo/devise_demo/app/controllers/admin_controller.rb

SELECT "users".* FROM "users"
---
  def manage_user
    @users = User.all