rails_demo/devise_demo/app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("name", "idcard", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "bob"], ["idcard", "1"], ["phone", "sdfsdf"], ["created_at", "2019-12-17 12:03:40.577802"], ["updated_at", "2019-12-17 12:03:40.577802"]]